Repository: YukiRed/flutter-portfolio
Catalog: lib/l10n/app_*.arb
Languages: ms

# appTitle
source: Desmond Liew — Portfolio
ms: Portfolio Saya

# navHome
source: Home
ms: Laman Utama

# navProjects
source: Projects
ms: Projek

# navLabs
source: Labs
ms: Makmal

# navLibrary
source: Library
ms: Perpustakaan

# navDiscover
source: Discover
ms: Teroka

# navPhilosophy
source: Philosophy
ms: Falsafah

# navFoundation
source: Foundation
ms: Asas

# navTimeline
source: Timeline
ms: Garis Masa

# navServices
source: Services
ms: Perkhidmatan

# navLogin
source: Login
ms: Log Masuk

# navWork
source: Work
ms: Kerja

# navAbout
source: About
ms: Tentang

# navPeople
source: People
ms: Tokoh

# navCredits
source: Credits
ms: Penghargaan

# navLogout
source: Logout
ms: Log Keluar

# navContact
source: Contact
ms: Hubungi

# menuTheme
source: Theme
ms: Tema

# menuThemeMode
source: Theme Mode
ms: Mod Tema

# themeSystem
source: System
ms: Sistem

# themeLight
source: Light
ms: Cerah

# themeDark
source: Dark
ms: Gelap

# menuPalette
source: Palette
ms: Palet

# paletteMetal
source: Metal
ms: Logam

# paletteEarth
source: Earth
ms: Tanah

# paletteWood
source: Wood
ms: Kayu

# paletteFire
source: Fire
ms: Api

# paletteWater
source: Water
ms: Air

# menuLanguage
source: Language
ms: Bahasa

# langEnglish
source: English
ms: Inggeris

# homeTagline
source: Applied AI Engineer · System Architect
ms: Jurutera AI Gunaan · Arkitek Sistem

# authUnlockTitle
source: Enter passphrase to unlock private content
ms: Masukkan frasa laluan untuk buka kandungan peribadi

# authPassphraseLabel
source: Passphrase
ms: Frasa laluan

# authUnlockButton
source: Unlock
ms: Buka

# authAlreadyLoggedInTitle
source: You are logged in.
ms: Anda sudah log masuk.

# authAlreadyLoggedInBody
source: Private items are visible. This passphrase is stored locally until you log out.
ms: Item peribadi kini kelihatan. Frasa laluan ini disimpan secara setempat sehingga anda log keluar.

# authWrongPassphrase
source: Wrong passphrase
ms: Frasa laluan salah

# authUnlockSuccess
source: Unlocked — private content will be shown.
ms: Dibuka — kandungan peribadi akan dipaparkan.

# authCanaryTip
source: Tip: You can add an optional canary in .env to validate the passphrase immediately.
ms: Tip: Anda boleh tambah canary pilihan dalam .env untuk sahkan frasa laluan dengan segera.

# lockPrivateTitle
source: This content is private.
ms: Kandungan ini peribadi.

# lockPrivateSubtitle
source: Log in with passphrase to view the content.
ms: Log masuk dengan frasa laluan untuk melihat kandungan.

# lockGoToLogin
source: Go to Login
ms: Pergi ke Log Masuk

# visibilityPrivate
source: Private
ms: Peribadi

# visibilityPublic
source: Public
ms: Umum

# notFound404
source: 404 — Not Found
ms: 404 — Tiada

# notFoundGeneric
source: Not found
ms: Tidak dijumpai

# notFoundPage
source: Page not found
ms: Halaman tidak dijumpai

# metaDisabled
source: Meta realm is disabled.
ms: Ruang meta dimatikan.

# workSectionTitle
source: Work
ms: Kerja

# workSectionSubtitle
source: Projects and Lab Experiments
ms: Projek dan eksperimen makmal

# workFilterAll
source: All
ms: Semua

# workFilterProjects
source: Projects
ms: Projek

# workFilterLabs
source: Labs
ms: Makmal

# workFilterProducts
source: Products
ms: Produk

# workEmpty
source: No items yet.
ms: Belum ada item.

# blogSectionSubtitle
source: Applied notes on engineering, evaluation, and calm systems.
ms: Catatan gunaan tentang kejuruteraan, penilaian, dan sistem tenang.

# blogEmpty
source: No blog posts yet.
ms: Belum ada entri blog.

# blogFilterAll
source: All posts
ms: Semua entri

# librarySectionSubtitle
source: Inputs to my thinking: readings, tools, press, and research notes.
ms: Input kepada pemikiran saya: bacaan, alat, liputan media, dan nota kajian.

# libraryEmpty
source: No library entries yet.
ms: Belum ada entri perpustakaan.

# libraryFilterAll
source: All entries
ms: Semua entri

# peopleSectionSubtitle
source: The thinkers, mentors, and influences behind my work.
ms: Pemikir, mentor, dan pengaruh di sebalik kerja saya.

# peopleEmpty
source: No people profiles yet.
ms: Belum ada profil tokoh.

# peopleFilterAll
source: All people
ms: Semua tokoh

# philosophySectionSubtitle
source: Inner operating system: mind, body, ethics, archetypes, practice.
ms: Sistem dalaman: minda, tubuh, etika, arketip, amalan.

# philosophyEmpty
source: No philosophy notes are published yet.
ms: Belum ada nota falsafah diterbitkan.

# timelineSubtitle
source: Milestones & significant updates
ms: Pencapaian & kemas kini penting

# timelineEmpty
source: No timeline entries yet.
ms: Belum ada catatan garis masa.

# contactSectionSubtitle
source: Get in touch
ms: Hubungi saya

# contactIntro
source: I read my own email and prefer calm, direct communication. Whether you’re exploring a project, inviting a talk, or just want to discuss an idea, a short message with context is the best place to start.
ms: Saya membaca semua emel sendiri dan lebih suka komunikasi yang tenang dan terus. Sama ada anda ingin berbincang tentang projek, menjemput saya memberi ceramah, atau sekadar berkongsi idea, mesej ringkas dengan konteks adalah permulaan terbaik.

# contactPrimaryTitle
source: Primary contact
ms: Cara utama untuk menghubungi

# contactPrimaryDescription
source: For most things — consulting, collaborations, questions about my work — email is the simplest way to reach me. If a live conversation is easier, you can book a short call instead.
ms: Untuk kebanyakan perkara — konsultansi, kolaborasi, atau soalan mengenai kerja saya — emel ialah cara paling mudah untuk berhubung. Jika anda lebih selesa berbual secara langsung, anda boleh menjadualkan panggilan pendek.

# contactPrimaryButtonCall
source: Schedule a 15-minute call
ms: Tempah panggilan 15 minit

# contactPrimaryLanguages
source: Languages: English · 中文 · Bahasa Malaysia
ms: Bahasa: English · 中文 · Bahasa Malaysia

# contactOfficeHoursLabel
source: Office hours
ms: Waktu bekerja

# contactOfficeHoursValue
source: Mon – Fri · 9:00 – 15:00
ms: Isnin – Jumaat · 9:00 – 15:00

# contactTimezoneLabel
source: Timezone
ms: Zon masa

# contactTimezoneValue
source: Malaysia / Singapore (GMT+8)
ms: Malaysia / Singapura (GMT+8)

# contactResponseTime
source: Typical response: within 1–2 days
ms: Kebiasaannya membalas dalam 1–2 hari

# contactPrivacyTitle
source: Privacy & boundaries
ms: Privasi & batasan

# contactPrivacyNote
source: I handle all communication personally and keep messages private. I never share emails or details with third parties.
ms: Semua komunikasi dikendalikan oleh saya sendiri dan tidak akan dikongsi dengan pihak ketiga.

# contactPrivacyWarning
source: For first contact, high-level descriptions are enough. Please avoid sending sensitive personal details or confidential client data in the initial email.
ms: Untuk mesej pertama, penerangan ringkas sudah memadai. Elakkan berkongsi maklumat peribadi sensitif atau data sulit pelanggan.

# contactPrivacyEthics
source: I don’t take on work involving surveillance tooling, dark patterns, or undisclosed data scraping.
ms: Saya tidak menerima projek yang melibatkan alat pengawasan, dark patterns, atau pengambilan data tanpa pengetahuan pengguna.

# testimonialsSectionTitle
source: Testimonials
ms: Testimoni

# testimonialsSectionSubtitle
source: Notes from collaborators and clients
ms: Catatan ringkas daripada rakan kerjasama dan klien

# contactTestimonialDescription
source: If you want to understand how I work with teams, you can read a few short notes from collaborators and clients.
ms: Jika anda ingin memahami cara saya bekerja dengan pasukan, anda boleh membaca beberapa catatan daripada rakan kerjasama dan klien.

# contactTestimonialButton
source: View testimonials
ms: Lihat testimoni

# contactAccessibilityTitle
source: Accessibility
ms: Aksesibiliti

# contactAccessibilityNote
source: If you have specific accessibility needs for communication — for example, written-only, captions for calls, or alternative tools — mention it in your message. I will adapt where I can.
ms: Jika anda mempunyai keperluan aksesibiliti tertentu — seperti komunikasi bertulis sahaja, kapsyen untuk panggilan, atau alat alternatif — beritahu saya dalam mesej. Saya akan cuba menyesuaikan keperluan anda.
